app/controllers/photos_controller.rb

	def destroy
		@photo = Photo.find(params[:id])
		product = @photo.product

		@photo.destroy
		flash[:success] = "Product image has been deleted!"
		@photos = Photo.where(product_id: product.id)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 2]]
SELECT "photos".* FROM "photos" WHERE "photos"."product_id" = $1  [["product_id", 2]]