app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "photos" ("product_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @product = current_user.products.new(product_params)
    if @product.save
      if params['images']
        params['images'].each do |img|
          @product.photos.create(image: img)

UPDATE "products" SET "title" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["title", "Test Product 1"], ["updated_at", 2017-04-20 18:06:25 UTC], ["id", 1]]
INSERT INTO "photos" ("product_id", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def update
    if @product.update(product_params)
      if params['images']
        params['images'].each do |img|
          @product.photos.create(image: img)