app/controllers/static_pages_controller.rb

  def home
  	@products = Product.all
---
SELECT "products".* FROM "products"