app/views/products/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."product_id" = $1  [["product_id", 1]]
---
			  	<tr>
			  		<td><%= image_tag(p.photos[0].image.url(:thumb)) if p.photos.length > 0 %></td>