app/views/products/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."product_id" = $1  [["product_id", 2]]
---
			<div class="thumbnail">
				<%= image_tag @product.photos[0].image.url if @product.photos.length > 0 %>